experiments/opengauss/huawei7/validation/model_calibration_20260824/sysbench-default-vs-recommended-20260826/default-r2.sysbench.log
sysbench 1.0.18 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 128 tps: 6223.77 qps: 100638.61 (r/w/o: 88069.26/0.00/12569.34) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 128 tps: 6925.78 qps: 110933.54 (r/w/o: 97083.97/0.00/13849.57) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 128 tps: 7010.58 qps: 112101.30 (r/w/o: 98079.15/0.00/14022.15) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 128 tps: 7060.69 qps: 113052.02 (r/w/o: 98928.64/0.00/14123.38) lat (ms,95%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 128 tps: 7012.04 qps: 112066.62 (r/w/o: 98047.54/0.00/14019.08) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 128 tps: 6901.05 qps: 110468.92 (r/w/o: 96668.82/0.00/13800.10) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 128 tps: 7685.31 qps: 122873.05 (r/w/o: 107494.43/0.00/15378.61) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 128 tps: 7688.26 qps: 123081.22 (r/w/o: 107704.70/0.00/15376.52) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 128 tps: 7762.75 qps: 124189.01 (r/w/o: 108664.51/0.00/15524.50) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 128 tps: 7397.09 qps: 118453.47 (r/w/o: 103654.30/0.00/14799.18) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 128 tps: 7337.83 qps: 117366.30 (r/w/o: 102695.64/0.00/14670.66) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 128 tps: 7122.05 qps: 113876.67 (r/w/o: 99629.57/0.00/14247.11) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 128 tps: 6988.36 qps: 112077.45 (r/w/o: 98103.72/0.00/13973.73) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 128 tps: 6908.34 qps: 110258.18 (r/w/o: 96445.50/0.00/13812.68) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 128 tps: 7612.63 qps: 122034.72 (r/w/o: 106804.46/0.00/15230.25) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 128 tps: 7704.33 qps: 122945.94 (r/w/o: 107538.27/0.00/15407.66) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 128 tps: 7581.77 qps: 121606.53 (r/w/o: 106442.99/0.00/15163.54) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 128 tps: 7414.99 qps: 118334.86 (r/w/o: 103510.88/0.00/14823.98) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 128 tps: 7309.26 qps: 117141.73 (r/w/o: 102520.23/0.00/14621.51) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 7124.93 qps: 113932.71 (r/w/o: 99685.86/0.00/14246.85) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 128 tps: 6940.13 qps: 111214.06 (r/w/o: 97330.80/0.00/13883.27) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 128 tps: 6844.22 qps: 109456.43 (r/w/o: 95760.99/0.00/13695.43) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 128 tps: 7612.47 qps: 121890.45 (r/w/o: 106668.51/0.00/15221.94) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 128 tps: 7685.72 qps: 122909.58 (r/w/o: 107542.14/0.00/15367.45) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 128 tps: 7620.30 qps: 121677.80 (r/w/o: 106434.20/0.00/15243.61) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 128 tps: 7450.19 qps: 119361.10 (r/w/o: 104461.72/0.00/14899.38) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 128 tps: 7329.13 qps: 117176.08 (r/w/o: 102521.81/0.00/14654.27) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 128 tps: 7164.65 qps: 114739.41 (r/w/o: 100407.12/0.00/14332.30) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 128 tps: 7020.25 qps: 112295.02 (r/w/o: 98252.53/0.00/14042.49) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 6848.86 qps: 109806.75 (r/w/o: 96107.02/0.00/13699.73) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 128 tps: 7604.53 qps: 121616.48 (r/w/o: 106411.41/0.00/15205.06) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 128 tps: 7610.16 qps: 121813.52 (r/w/o: 106590.21/0.00/15223.31) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 128 tps: 7658.74 qps: 122352.06 (r/w/o: 107035.59/0.00/15316.47) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 128 tps: 7419.55 qps: 118807.95 (r/w/o: 103965.84/0.00/14842.11) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 128 tps: 7365.59 qps: 117991.40 (r/w/o: 103263.23/0.00/14728.18) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 128 tps: 7139.34 qps: 114082.40 (r/w/o: 99809.73/0.00/14272.67) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 128 tps: 6959.32 qps: 111233.15 (r/w/o: 97312.50/0.00/13920.65) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 128 tps: 6861.06 qps: 109640.88 (r/w/o: 95923.76/0.00/13717.12) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 128 tps: 7526.47 qps: 120808.01 (r/w/o: 105749.09/0.00/15058.92) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 7662.34 qps: 122696.37 (r/w/o: 107364.70/0.00/15331.68) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 128 tps: 7712.73 qps: 123270.54 (r/w/o: 107848.08/0.00/15422.46) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 128 tps: 7369.27 qps: 117849.34 (r/w/o: 103113.80/0.00/14735.54) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 128 tps: 7370.74 qps: 117909.87 (r/w/o: 103169.39/0.00/14740.48) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 128 tps: 7198.62 qps: 115158.95 (r/w/o: 100761.71/0.00/14397.24) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 128 tps: 7013.25 qps: 111943.08 (r/w/o: 97912.58/0.00/14030.50) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 128 tps: 6822.08 qps: 109387.26 (r/w/o: 95744.11/0.00/13643.15) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 128 tps: 7581.15 qps: 121435.48 (r/w/o: 106269.18/0.00/15166.30) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 128 tps: 7613.85 qps: 121731.60 (r/w/o: 106505.90/0.00/15225.70) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 128 tps: 7644.86 qps: 122431.76 (r/w/o: 107139.04/0.00/15292.73) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 7451.65 qps: 119116.30 (r/w/o: 104216.00/0.00/14900.30) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 128 tps: 7354.21 qps: 117683.27 (r/w/o: 102973.86/0.00/14709.41) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 128 tps: 7130.57 qps: 113895.32 (r/w/o: 99640.17/0.00/14255.15) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 128 tps: 6964.64 qps: 111638.58 (r/w/o: 97703.29/0.00/13935.29) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 128 tps: 6809.35 qps: 108845.58 (r/w/o: 95231.89/0.00/13613.70) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 128 tps: 7591.04 qps: 121456.63 (r/w/o: 106270.55/0.00/15186.08) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 128 tps: 7668.21 qps: 122760.38 (r/w/o: 107429.95/0.00/15330.43) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 128 tps: 7687.63 qps: 122925.10 (r/w/o: 107541.84/0.00/15383.27) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 128 tps: 7421.03 qps: 118869.48 (r/w/o: 104031.43/0.00/14838.05) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 128 tps: 7371.35 qps: 117700.63 (r/w/o: 102955.93/0.00/14744.70) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 7087.14 qps: 113369.26 (r/w/o: 99195.98/0.00/14173.28) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 128 tps: 6983.16 qps: 111931.51 (r/w/o: 97964.20/0.00/13967.31) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 128 tps: 6751.02 qps: 107902.38 (r/w/o: 94405.33/0.00/13497.05) lat (ms,95%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 128 tps: 7540.79 qps: 120572.64 (r/w/o: 105499.06/0.00/15073.58) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 128 tps: 7653.29 qps: 122533.56 (r/w/o: 107219.99/0.00/15313.57) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 128 tps: 7675.03 qps: 122907.41 (r/w/o: 107557.35/0.00/15350.06) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 128 tps: 7367.97 qps: 117740.47 (r/w/o: 103000.54/0.00/14739.93) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 128 tps: 7377.69 qps: 118107.04 (r/w/o: 103350.67/0.00/14756.37) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 128 tps: 7154.11 qps: 114526.77 (r/w/o: 100219.54/0.00/14307.23) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 128 tps: 6989.92 qps: 111694.59 (r/w/o: 97720.76/0.00/13973.83) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 6870.11 qps: 109861.85 (r/w/o: 96117.63/0.00/13744.22) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 128 tps: 7537.51 qps: 120952.49 (r/w/o: 105873.47/0.00/15079.03) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 128 tps: 7464.93 qps: 119658.01 (r/w/o: 104725.16/0.00/14932.85) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 128 tps: 7444.07 qps: 118621.38 (r/w/o: 103741.23/0.00/14880.15) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 128 tps: 7280.55 qps: 116592.86 (r/w/o: 102026.75/0.00/14566.11) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 128 tps: 7031.90 qps: 112449.38 (r/w/o: 98389.58/0.00/14059.80) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 128 tps: 6897.05 qps: 110317.74 (r/w/o: 96522.65/0.00/13795.09) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 128 tps: 7203.09 qps: 115349.33 (r/w/o: 100943.15/0.00/14406.18) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 128 tps: 7629.82 qps: 122162.02 (r/w/o: 106908.38/0.00/15253.64) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 128 tps: 7661.84 qps: 122625.45 (r/w/o: 107297.77/0.00/15327.68) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 7678.38 qps: 122873.02 (r/w/o: 107513.27/0.00/15359.75) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8180116
        write:                           0
        other:                           1168588
        total:                           9348704
    transactions:                        584294 (7298.53 per sec.)
    queries:                             9348704 (116776.45 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          80.0553s
    total number of events:              584294

Latency (ms):
         min:                                    1.87
         avg:                                   17.53
         max:                                  114.66
         95th percentile:                       21.89
         sum:                             10241628.16

Threads fairness:
    events (avg/stddev):           4564.7969/47.71
    execution time (avg/stddev):   80.0127/0.02